ObjectStorage/src/InformationRegisters/ох_ЗаданияДляОбработкиОбъектовХранилища/ох_ЗаданияДляОбработкиОбъектовХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ох_ЗаданияДляОбработкиОбъектовХранилища</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Операция</name>
    <type>
      <types>EnumRef.ох_ОперацииНадОбъектамиВОбъектномХранилище</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ох_СтатусыВыполненияЗаданийОбъектногоХранилища</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопытокВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>DefinedType.ох_ПрисоединенныеФайлыОбъектногоХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВладелецФайла</name>
    <type>
      <types>DefinedType.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СервисныйАккаунт</name>
    <type>
      <types>CatalogRef.ох_СервисныеАккаунтыОбъектныхХранилищ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Бакет</name>
    <type>
      <types>CatalogRef.ох_БакетыОбъектныхХранилищ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ObjectStorage/src/Enums/ох_СтатусыВыполненияЗаданийОбъектногоХранилища/ох_СтатусыВыполненияЗаданийОбъектногоХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ох_СтатусыВыполненияЗаданийОбъектногоХранилища</name>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>ЗавершеноСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>ВОчереди</name>
  </enumValues>
</mdclass:Enum>

ObjectStorage/src/Enums/ох_ОперацииНадОбъектамиВОбъектномХранилище/ох_ОперацииНадОбъектамиВОбъектномХранилище.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ох_ОперацииНадОбъектамиВОбъектномХранилище</name>
  <enumValues>
    <name>Выгрузка</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
</mdclass:Enum>

ObjectStorage/src/InformationRegisters/ох_ЗаданияДляОбработкиОбъектовХранилища/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РегистрацияЗаданий

Функция НовыйПараметрыСозданияЗаданияДляОбработкиФайла() Экспорт
	
	ПараметрыСозданияЗадания = Новый Структура;
	ПараметрыСозданияЗадания.Вставить("Файл");
	ПараметрыСозданияЗадания.Вставить("ВладелецФайла");
	ПараметрыСозданияЗадания.Вставить("СервисныйАккаунт",
		ох_ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ох_СервисныеАккаунтыОбъектныхХранилищ.ПустаяСсылка"));
	ПараметрыСозданияЗадания.Вставить("Бакет",
		ох_ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ох_БакетыОбъектныхХранилищ.ПустаяСсылка"));
	
	Возврат ПараметрыСозданияЗадания;
	
КонецФункции

Процедура СоздатьЗаданиеНаВыгрузкуФайла(ПараметрыСозданияЗадания) Экспорт
	СоздатьНовоеЗаданиеДляФайла(ПараметрыСозданияЗадания, ОперацииНадФайлами().Выгрузка);
КонецПроцедуры

Процедура СоздатьЗаданиеНаУдалениеФайла(ПараметрыСозданияЗадания) Экспорт
	СоздатьНовоеЗаданиеДляФайла(ПараметрыСозданияЗадания, ОперацииНадФайлами().Удаление);
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеЗаданий

Процедура ОбработатьЗадания() Экспорт
	ОбработатьОчередьЗаданий(ЗаданияДляОбработки());
КонецПроцедуры

Процедура ОбработатьОчередьЗаданий(Очередь) Экспорт
	ПараметрыВыполненияЗаданий = ПараметрыВыполненияЗаданий();
	ВыполнитьЗаданияДляОбработкиФайлов(Очередь, ПараметрыВыполненияЗаданий);
КонецПроцедуры

Процедура ПоместитьЗаданияДляОбработкиВМенеджерВременныхТаблиц(МенеджерВрменныхТаблиц) Экспорт
	// BSLLS:QueryParseError-off Ложное срабатывание: bsl-ls не парсит POW в языке запросов, но платформа его поддерживает (проверено конструктором запросов).
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВрменныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Период КАК Период,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Файл КАК Файл,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ВладелецФайла КАК ВладелецФайла,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.СервисныйАккаунт КАК СервисныйАккаунт,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Бакет КАК Бакет,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Операция КАК Операция,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Статус КАК Статус,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ДатаНачалаВыполнения КАК ДатаНачалаВыполнения,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ДатаОкончанияВыполнения КАК ДатаОкончанияВыполнения,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.КоличествоПопытокВыполнения КАК КоличествоПопытокВыполнения,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Ответственный КАК Ответственный,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ИдентификаторФайла КАК ИдентификаторФайла
	|ПОМЕСТИТЬ Задания
	|ИЗ
	|	РегистрСведений.ох_ЗаданияДляОбработкиОбъектовХранилища.СрезПоследних КАК ох_ЗаданияДляОбработкиОбъектовХранилища
	|ГДЕ
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Статус = ЗНАЧЕНИЕ(Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.КОбработке)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Период,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Файл,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ВладелецФайла,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.СервисныйАккаунт,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Бакет,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Операция,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Статус,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ДатаНачалаВыполнения,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ДатаОкончанияВыполнения,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.КоличествоПопытокВыполнения,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ОписаниеОшибки,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Ответственный,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ИдентификаторЗаписи,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ИдентификаторФайла
	|ИЗ
	|	РегистрСведений.ох_ЗаданияДляОбработкиОбъектовХранилища.СрезПоследних КАК ох_ЗаданияДляОбработкиОбъектовХранилища
	|ГДЕ
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Статус = ЗНАЧЕНИЕ(Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.ЗавершеноСОшибкой)
	|	И &ОбрабатыватьОшибкиПовторно
	|	И ох_ЗаданияДляОбработкиОбъектовХранилища.КоличествоПопытокВыполнения < &МаксимальноеКоличествоПовторов
	|	И &ТекущаяДата >= ДОБАВИТЬКДАТЕ(ох_ЗаданияДляОбработкиОбъектовХранилища.ДатаОкончанияВыполнения, СЕКУНДА, &БазоваяЗадержкаПриПовторнойОбработки * POW(2, ох_ЗаданияДляОбработкиОбъектовХранилища.КоличествоПопытокВыполнения))";
	// BSLLS:QueryParseError-on
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Запрос.УстановитьПараметр("БазоваяЗадержкаПриПовторнойОбработки",
		ох_ОбъектноеХранилище.БазоваяЗадержкаПриПовторнойОбработкиОшибокОчереди());
	Запрос.УстановитьПараметр("МаксимальноеКоличествоПовторов",
		ох_ОбъектноеХранилище.МаксимальноеКоличествоПопытокОбработкиОшибокОчереди());
	Запрос.УстановитьПараметр("ОбрабатыватьОшибкиПовторно",
		ох_ОбъектноеХранилище.ОбрабатыватьОшибкиОчередиПовторно());
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПоместитьЗаданияВОчередиВМенеджерВременныхТаблиц(МенеджерВрменныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВрменныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Период КАК Период,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Файл КАК Файл,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ВладелецФайла КАК ВладелецФайла,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.СервисныйАккаунт КАК СервисныйАккаунт,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Бакет КАК Бакет,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Операция КАК Операция,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Статус КАК Статус,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ДатаНачалаВыполнения КАК ДатаНачалаВыполнения,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ДатаОкончанияВыполнения КАК ДатаОкончанияВыполнения,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.КоличествоПопытокВыполнения КАК КоличествоПопытокВыполнения,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Ответственный КАК Ответственный,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.ИдентификаторФайла КАК ИдентификаторФайла
	|ПОМЕСТИТЬ Задания
	|ИЗ
	|	РегистрСведений.ох_ЗаданияДляОбработкиОбъектовХранилища КАК ох_ЗаданияДляОбработкиОбъектовХранилища
	|ГДЕ
	|	ох_ЗаданияДляОбработкиОбъектовХранилища.Статус В (ЗНАЧЕНИЕ(Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.ВОчереди), ЗНАЧЕНИЕ(Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.Выполняется))";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ЗаданияПоИдентификаторам(ИдентификаторыЗаданий) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.Период КАК Период,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.Файл КАК Файл,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.ВладелецФайла КАК ВладелецФайла,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.СервисныйАккаунт КАК СервисныйАккаунт,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.Бакет КАК Бакет,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.Операция КАК Операция,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.Статус КАК Статус,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.ДатаНачалаВыполнения КАК ДатаНачалаВыполнения,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.ДатаОкончанияВыполнения КАК ДатаОкончанияВыполнения,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.КоличествоПопытокВыполнения КАК КоличествоПопытокВыполнения,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.ОписаниеОшибки КАК ОписаниеОшибки,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.Ответственный КАК Ответственный,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.ИдентификаторФайла КАК ИдентификаторФайла
		|ИЗ
		|	РегистрСведений.ох_ЗаданияДляОбработкиОбъектовХранилища КАК ох_ЗаданияДляОбработкиОбъектовХранилища
		|ГДЕ
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.ИдентификаторЗаписи В(&ИдентификаторыЗаданий)";
	
	Запрос.УстановитьПараметр("ИдентификаторыЗаданий", ИдентификаторыЗаданий);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ПеренестиЗаданиеВОчередь(Задание) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Статус", СтатусВОчередь());
	
	ОбновитьСостояниеЗадания(Задание, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ЗарегистрироватьЗаданиеКОбработке(Задание) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Статус", СтатусКОбработке());
	
	ОбновитьСостояниеЗадания(Задание, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура УстановитьОшибкуВыполненияЗадания(Задание, ТекстОшибки) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОписаниеОшибки", Новый ХранилищеЗначения(ТекстОшибки, Новый СжатиеДанных(9)));
	ДополнительныеПараметры.Вставить("Статус", СтатусЗавершеноСОшибкой());
	
	ЗаписатьОбработкуЗадания(Задание, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбслуживаниеРегистраЗаданий

Процедура ОчиститьДанныеЗаданий(КоличествоДнейХраненияЗаданий) Экспорт
	
	ДатаУдаленияЗаданий = НачалоДня(ТекущаяДатаСеанса() - 86400 * КоличествоДнейХраненияЗаданий);
	
	Пока Истина Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.Период КАК Период,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.Файл КАК Файл,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.ВладелецФайла КАК ВладелецФайла,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.СервисныйАккаунт КАК СервисныйАккаунт,
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.Бакет КАК Бакет
		|ИЗ
		|	РегистрСведений.ох_ЗаданияДляОбработкиОбъектовХранилища КАК ох_ЗаданияДляОбработкиОбъектовХранилища
		|ГДЕ
		|	ох_ЗаданияДляОбработкиОбъектовХранилища.Период < &ДатаУдаленияЗаданий
		|	И ох_ЗаданияДляОбработкиОбъектовХранилища.Статус В (ЗНАЧЕНИЕ(Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.Выполнено), ЗНАЧЕНИЕ(Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.ЗавершеноСОшибкой))
		|УПОРЯДОЧИТЬ ПО
		|	Период";
		
		Запрос.УстановитьПараметр("ДатаУдаленияЗаданий", ДатаУдаленияЗаданий);
		// BSLLS:CreateQueryInCycle-off Порционная обработка (батч-пагинатор) по std725: старые задания удаляются, выборка сдвигается, цикл конечен.
		Выборка = Запрос.Выполнить().Выбрать();
		// BSLLS:CreateQueryInCycle-on

		Если Не Выборка.Количество() Тогда
			Прервать;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.ох_ЗаданияДляОбработкиОбъектовХранилища.СоздатьНаборЗаписей();
				
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				НаборЗаписей.Отбор.Файл.Установить(Выборка.Файл);
				НаборЗаписей.Отбор.ВладелецФайла.Установить(Выборка.ВладелецФайла);
				НаборЗаписей.Отбор.СервисныйАккаунт.Установить(Выборка.СервисныйАккаунт);
				НаборЗаписей.Отбор.Бакет.Установить(Выборка.Бакет);
				
				НаборЗаписей.Записать();
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ЗаписьЖурналаРегистрации(
				"Объектное хранилище.Очистка заданий",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.ох_ЗаданияДляОбработкиОбъектовХранилища,
				,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			Прервать;
			
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьНовоеЗаданиеДляФайла(ПараметрыСозданияЗадания, Операция)
	
	НачатьТранзакцию();
	
	Попытка
		
		УдалитьНевыполненныеЗадания(ПараметрыСозданияЗадания);
		
		ЗаписьЗадания = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьЗадания, ПараметрыСозданияЗадания);
		
		ЗаписьЗадания.Операция            = Операция;
		ЗаписьЗадания.Период              = ТекущаяДатаСеанса();
		ЗаписьЗадания.Ответственный       = ох_ОбщегоНазначения.ТекущийПользователь();
		ЗаписьЗадания.ИдентификаторЗаписи = Строка(Новый УникальныйИдентификатор());
		ЗаписьЗадания.ИдентификаторФайла  = ХешКлюча(ПараметрыСозданияЗадания);
		ЗаписьЗадания.Статус              = СтатусКОбработке();
		
		Если Не ЗначениеЗаполнено(ЗаписьЗадания.ВладелецФайла) Тогда
			ЗаписьЗадания.ВладелецФайла =
				ох_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСозданияЗадания.Файл, "ВладелецФайла");
		КонецЕсли;
		
		ЗаписьЗадания.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьНевыполненныеЗадания(ПараметрыЗадания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ох_ЗаданияДляОбработкиОбъектовХранилищаСрезПоследних.Период КАК Период,
		|	ох_ЗаданияДляОбработкиОбъектовХранилищаСрезПоследних.Файл КАК Файл,
		|	ох_ЗаданияДляОбработкиОбъектовХранилищаСрезПоследних.ВладелецФайла КАК ВладелецФайла,
		|	ох_ЗаданияДляОбработкиОбъектовХранилищаСрезПоследних.СервисныйАккаунт КАК СервисныйАккаунт,
		|	ох_ЗаданияДляОбработкиОбъектовХранилищаСрезПоследних.Бакет КАК Бакет
		|ИЗ
		|	РегистрСведений.ох_ЗаданияДляОбработкиОбъектовХранилища.СрезПоследних(
		|			,
		|			Файл = &Файл
		|				И ВладелецФайла = &ВладелецФайла
		|				И СервисныйАккаунт = &СервисныйАккаунт
		|				И Бакет = &Бакет) КАК ох_ЗаданияДляОбработкиОбъектовХранилищаСрезПоследних
		|ГДЕ
		|	ох_ЗаданияДляОбработкиОбъектовХранилищаСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.КОбработке)";
	
	Запрос.УстановитьПараметр("Файл"            , ПараметрыЗадания.Файл);
	Запрос.УстановитьПараметр("ВладелецФайла"   , ПараметрыЗадания.ВладелецФайла);
	Запрос.УстановитьПараметр("СервисныйАккаунт", ПараметрыЗадания.СервисныйАккаунт);
	Запрос.УстановитьПараметр("Бакет"           , ПараметрыЗадания.Бакет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗаданиеВыполняется(Задание)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДатаНачалаВыполнения", ТекущаяДатаСеанса());
	ДополнительныеПараметры.Вставить("ДатаОкончанияВыполнения", Дата(1, 1, 1));
	ДополнительныеПараметры.Вставить("Статус", СтатусВыполняется());
	
	ОбновитьСостояниеЗадания(Задание, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура УстановитьУспешноеВыполнениеЗадания(Задание)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Статус", СтатусВыполнено());
	
	ЗаписатьОбработкуЗадания(Задание, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ЗаписатьОбработкуЗадания(Задание, ДополнительныеПараметры)
	
	ДополнительныеПараметры.Вставить("ДатаОкончанияВыполнения", ТекущаяДатаСеанса());
	ДополнительныеПараметры.Вставить("ОбновитьПопыткуВыполнения", Истина);
	
	ОбновитьСостояниеЗадания(Задание, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбновитьСостояниеЗадания(Задание, ДополнительныеПараметры)
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить(
		Метаданные.РегистрыСведений.ох_ЗаданияДляОбработкиОбъектовХранилища.ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("Период"          , Задание.Период);
	ЭлементБлокировки.УстановитьЗначение("Файл"            , Задание.Файл);
	ЭлементБлокировки.УстановитьЗначение("ВладелецФайла"   , Задание.ВладелецФайла);
	ЭлементБлокировки.УстановитьЗначение("СервисныйАккаунт", Задание.СервисныйАккаунт);
	ЭлементБлокировки.УстановитьЗначение("Бакет"           , Задание.Бакет);
	
	НачатьТранзакцию();
	Попытка
		
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Период.Установить(Задание.Период);
		НаборЗаписей.Отбор.Файл.Установить(Задание.Файл);
		НаборЗаписей.Отбор.ВладелецФайла.Установить(Задание.ВладелецФайла);
		НаборЗаписей.Отбор.СервисныйАккаунт.Установить(Задание.СервисныйАккаунт);
		НаборЗаписей.Отбор.Бакет.Установить(Задание.Бакет);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() Тогда
			
			Для Каждого Запись Из НаборЗаписей Цикл
				
				ЗаполнитьЗначенияСвойств(Запись, ДополнительныеПараметры);
				
				ОбновитьПопыткуВыполнения = ох_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
					ДополнительныеПараметры, "ОбновитьПопыткуВыполнения", Ложь);
					
				Если ОбновитьПопыткуВыполнения Тогда
					Запись.КоличествоПопытокВыполнения = Запись.КоличествоПопытокВыполнения + 1;
				КонецЕсли;
				
			КонецЦикла;
			
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Функция ХешКлюча(Ключ)
	
	КлючЗаписиСтрокой = ох_ОбщегоНазначения.ЗначениеВСтрокуXML(Ключ);
	
	ХешКлюча = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешКлюча.Добавить(КлючЗаписиСтрокой);
	
	Возврат ПолучитьHexСтрокуИзДвоичныхДанных(ХешКлюча.ХешСумма);
	
КонецФункции

Функция ЗаданияДляОбработки()
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПоместитьЗаданияДляОбработкиВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задания.Период КАК Период,
	|	Задания.Файл КАК Файл,
	|	Задания.ВладелецФайла КАК ВладелецФайла,
	|	Задания.СервисныйАккаунт КАК СервисныйАккаунт,
	|	Задания.Бакет КАК Бакет,
	|	Задания.Операция КАК Операция,
	|	Задания.Статус КАК Статус,
	|	Задания.ДатаНачалаВыполнения КАК ДатаНачалаВыполнения,
	|	Задания.ДатаОкончанияВыполнения КАК ДатаОкончанияВыполнения,
	|	Задания.КоличествоПопытокВыполнения КАК КоличествоПопытокВыполнения,
	|	Задания.ОписаниеОшибки КАК ОписаниеОшибки,
	|	Задания.Ответственный КАК Ответственный,
	|	Задания.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	Задания.ИдентификаторФайла КАК ИдентификаторФайла
	|ИЗ
	|	Задания КАК Задания";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ВыполнитьЗаданияДляОбработкиФайлов(ЗаданияДляОбработки, ПараметрыВыполненияЗаданий)
	
	ПараметрыРаботыОбъектногоХранилища = ох_ОбъектноеХранилище.НовыйПараметрыРаботыСОбъектнымХранилищем();
	
	Пока ЗаданияДляОбработки.Следующий() Цикл
		
		УстановитьЗаданиеВыполняется(ЗаданияДляОбработки);
		
		ПараметрыРаботыОбъектногоХранилища.СервисныйАккаунт = ЗаданияДляОбработки.СервисныйАккаунт;
		ПараметрыРаботыОбъектногоХранилища.Бакет            = ЗаданияДляОбработки.Бакет;
		
		Попытка
			
			Результат = ОбработатьФайл(ЗаданияДляОбработки, ПараметрыРаботыОбъектногоХранилища, ПараметрыВыполненияЗаданий);
			
			Если Не Результат.РезультатОперации.Ошибка Тогда
				УстановитьУспешноеВыполнениеЗадания(ЗаданияДляОбработки);
			Иначе
				УстановитьОшибкуВыполненияЗадания(ЗаданияДляОбработки, Результат.РезультатОперации.СообщениеОшибки);
			КонецЕсли;
			
		Исключение
			УстановитьОшибкуВыполненияЗадания(
				ЗаданияДляОбработки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыВыполненияЗаданий()
	
	ПараметрыВыполненияЗаданий = Новый Структура;
	ПараметрыВыполненияЗаданий.Вставить("ОперацииНадФайлами", ОперацииНадФайлами());
	
	Возврат ПараметрыВыполненияЗаданий;
	
КонецФункции

Функция ОперацииНадФайлами()
	
	ОперацииНадФайлами = Новый Структура;
	
	ОперацияВыгрузки = ох_ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.ох_ОперацииНадОбъектамиВОбъектномХранилище.Выгрузка");
	
	ОперацияУдаления = ох_ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.ох_ОперацииНадОбъектамиВОбъектномХранилище.Удаление");
	
	ОперацииНадФайлами.Вставить("Выгрузка", ОперацияВыгрузки);
	ОперацииНадФайлами.Вставить("Удаление", ОперацияУдаления);

	Возврат ОперацииНадФайлами;
	
КонецФункции

Функция СтатусКОбработке()
	Возврат ох_ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.КОбработке");
КонецФункции

Функция СтатусВОчередь()
	Возврат ох_ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.ВОчереди");
КонецФункции

Функция СтатусВыполняется()
	Возврат ох_ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.Выполняется");
КонецФункции

Функция СтатусВыполнено()
	Возврат ох_ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.Выполнено");
КонецФункции

Функция СтатусЗавершеноСОшибкой()
	Возврат ох_ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.ох_СтатусыВыполненияЗаданийОбъектногоХранилища.ЗавершеноСОшибкой");
КонецФункции

Функция ОбработатьФайл(Задание, ПараметрыРаботыОбъектногоХранилища, ПараметрыВыполненияЗаданий)
	
	Если Задание.Операция = ПараметрыВыполненияЗаданий.ОперацииНадФайлами.Выгрузка Тогда
		Возврат ВыгрузитьФайл(Задание, ПараметрыРаботыОбъектногоХранилища);
	ИначеЕсли Задание.Операция = ПараметрыВыполненияЗаданий.ОперацииНадФайлами.Удаление Тогда
		Возврат УдалитьФайл(Задание, ПараметрыРаботыОбъектногоХранилища);
	Иначе
		ВызватьИсключение СтрШаблон("Обработка операции %1 не определена", Задание.Операция);
	КонецЕсли;
	
КонецФункции

Функция ВыгрузитьФайл(Задание, ПараметрыРаботыОбъектногоХранилища)
	
	ПараметрыЗагрузки = ох_ОбъектноеХранилище.НовыйПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ДанныеФайла.Ссылка        = Задание.Файл;
	ПараметрыЗагрузки.ДанныеФайла.ВладелецФайла = Задание.ВладелецФайла;
	
	Возврат ох_ОбъектноеХранилище.ЗагрузитьФайл(ПараметрыРаботыОбъектногоХранилища, ПараметрыЗагрузки);
	
КонецФункции

Функция УдалитьФайл(Задание, ПараметрыРаботыОбъектногоХранилища)
	
	ПараметрыУдаления = ох_ОбъектноеХранилище.НовыйПараметрыУдаленияФайла();
	ПараметрыУдаления.ДанныеФайла.Ссылка        = Задание.Файл;
	ПараметрыУдаления.ДанныеФайла.ВладелецФайла = Задание.ВладелецФайла;
	
	Возврат ох_ОбъектноеХранилище.УдалитьФайл(ПараметрыРаботыОбъектногоХранилища, ПараметрыУдаления);
	
КонецФункции

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
